<template>
  <div class="assistment">
    <div>尊敬的用户您好，在进入星萤app前，请务必认真阅读和理解以下《APP用户服务协议》。本协议阐述之条款和条件适用于您使用APP的各种产品和服务。</div>
    <div class="fontFat">一、声明</div>
    <div class="fontthin">1.平台内提供的所有服务和产品的所有权和解释权归本平台所有。</div>
    <div class="fontthin">2.点击右下方“接受”按钮，即表示为您已自愿接受协议中所有的条款和内容。</div>
    <div class="fontthin">3.协议条款的效力范围仅限于本平台，您在平台的行为均受协议的约束。</div>
    <div class="fontthin">4.您使用平台服务的行为，即被视为您已知悉本平台的相关公告并同意。</div>
    <div class="fontthin">5.星萤app内不包含任何充值功能，仅向用户提供行为数据服务，如需享受成长加速等服务，请关注“星萤自律”公众号。</div>
    <div class="fontFat fontthin">二、用户管理</div>
    <div class="fontthin">1.您在本平台的所有行为都须符合中国的法律法规，不得利用本平台提供的服务制作、复制、发布、传播以下信息：（一）反对宪法基本原则的；（二）危害国家安全、泄露国家秘密、颠覆国家政权、破坏国家统一的；（三）损害国家荣誉和利益的；（四）煽动民族仇恨、民族歧视、破坏民族团结的；（五）破坏国家宗教政策，宣扬邪教和封建迷信的；（六）散布谣言、扰乱社会秩序、破坏社会稳定的；（七）散布淫秽、色情、赌博、暴力、凶杀、恐怖内容或者教唆犯罪的；（八）侮辱或者诽谤他人，侵害他人合法权益的；（九）法律、法规禁止的其他内容。</div>
    <div class="fontthin">2.如果本平台发现您在app使用过程中出现违规操作或内容，本平台有权在不通知您的情况下采取包括但不仅限于向国家有关机关报告、保存有关记录、删除该内容及链接地址、关闭服务器、暂停您账号的操作权限、停止向您提供服务等措施。</div>
    <div class="fontthin">3.我们承诺，对您个人的信息和隐私的安全承担保密义务。未经您授权或同意，本平台不会将您的个人资料信息泄露给第三方，但以下情况除外，且本平台不承担任何责任：（一）政府单位按照中华人民共和国的法律、行政法规、部门规章、司法解释等规范性法律文件（统称“法律法规”），要求本平台提供的；（二）由于您不慎将账户和密码告知或泄露给他人，由此导致的个人资料泄露；（三）包括但不仅限于黑客攻击、计算机病毒侵入或发作、政府管制等不可抗力而造成的用户个人资料泄露、丢失、被盗用或被篡改等。</div>
    <div class="fontFat fontthin">三、知识产权。</div>
    <div class="fontthin">1.本平台所有的域名、商号、商标、文字、视像及声音内容、图形及图像均受有关所有权和知识产权法律的保护，未经本平台事先以书面明确允许，任何个人或单位，均不得进行复制和使用。</div>
 </div>
</template>

<script setup>
import { reactive, getCurrentInstance } from "vue";
const data = reactive({
  
});


</script>

<style lang="scss">
@import "@/views/login/components/assistment.scss";
</style>
